In [1]:
%load_ext autoreload

In [2]:
%autoreload 1
import pandas as pd
import datetime as dt
from graph_tool.all import *
%aimport gtfs_parser
#import gtfs_parser
%aimport timetable
#import timetable

In [3]:
gtfs_path = 'GTFS'

In [4]:
parser = gtfs_parser.gtfs_parser(gtfs_path)

In [11]:
parser.get_busiest_date()

datetime.date(2019, 4, 26)

In [5]:
date = dt.date(2019, 4, 27)
#date = parser.get_busiest_date()

In [12]:
service_ids = parser.service_ids(date)
service_ids

frozenset({'105806',
           '105807',
           '105812',
           '1903',
           '62006',
           '62007',
           '62011',
           '62012'})

In [7]:
trips = parser.get_trips(service_ids)
trips.head()

,route_id,service_id,trip_id,direction_id,block_id,shape_id,direction,wheelchair_accessible,schd_trip_id
0,103,62006,6201765747070,0,620208374407,6200711,West,1,1765747070
1,103,62006,6201765751070,1,620208374407,6200717,East,1,1765751070
2,103,62006,6201765753070,1,620208374407,6200717,East,1,1765753070
3,103,62006,6201765754070,1,620208374407,6200717,East,1,1765754070
4,103,62006,6201765756070,1,620208374407,6200717,East,1,1765756070

In [8]:
stop_times = parser.get_stop_times(trips['trip_id'])
stop_times.head()

,trip_id,arrival_time,departure_time,stop_id,stop_sequence,stop_headsign,pickup_type,shape_dist_traveled
0,58139647377,1680.0,1680.0,30204,1,Howard,0,0
1,58139647377,1830.0,1830.0,30242,2,Howard,0,3618
2,58139647377,1890.0,1890.0,30079,3,Howard,0,5810
3,58139647377,1950.0,1950.0,30102,4,Howard,0,7313
4,58139647377,2040.0,2040.0,30011,5,Howard,0,9664

In [9]:
stops = parser.get_stops(stop_times['stop_id'].unique())
stops.head()

,stop_id,stop_code,stop_name,stop_desc,location_type,parent_station,wheelchair_boarding,geometry
0,1,1,Jackson & Austin Terminal,"Jackson & Austin Terminal, Northeastbound, Bus...",0,NaN,1,POINT (-87.77410482000001 41.87632184)
1,2,2,5900 W Jackson,"5900 W Jackson, Eastbound, Southside of the St...",0,NaN,1,POINT (-87.77131794 41.87706679)
2,3,3,Jackson & Menard,"Jackson & Menard, Eastbound, Southside of the ...",0,NaN,1,POINT (-87.76975039 41.87695725)
3,4,4,5700 W Jackson,"5700 W Jackson, Eastbound, Southside of the St...",0,NaN,1,POINT (-87.76745055000001 41.87702418)
4,6,6,Jackson & Lotus,"Jackson & Lotus, Eastbound, Southeast Corner",0,NaN,1,POINT (-87.76144599999999 41.876513)